balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128GP708A.PIC
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="C1CFG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1CFG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BRP" edc:desc="" edc:mask="0x3f" edc:name="BRP" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="SJW" edc:desc="" edc:mask="0x3" edc:name="SJW" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BRP0" edc:desc="" edc:mask="0x1" edc:name="BRP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP1" edc:desc="" edc:mask="0x1" edc:name="BRP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP2" edc:desc="" edc:mask="0x1" edc:name="BRP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP3" edc:desc="" edc:mask="0x1" edc:name="BRP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP4" edc:desc="" edc:mask="0x1" edc:name="BRP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP5" edc:desc="" edc:mask="0x1" edc:name="BRP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SJW0" edc:desc="" edc:mask="0x1" edc:name="SJW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SJW1" edc:desc="" edc:mask="0x1" edc:name="SJW1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n---nnnnnnnnnnn" edc:cname="C1CFG2" edc:desc="" edc:impl="0x47ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1CFG2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRSEG" edc:desc="" edc:mask="0x7" edc:name="PRSEG" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SEG1PH" edc:desc="" edc:mask="0x7" edc:name="SEG1PH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH" edc:desc="" edc:mask="0x7" edc:name="SEG2PH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PRSEG0" edc:desc="" edc:mask="0x1" edc:name="PRSEG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRSEG1" edc:desc="" edc:mask="0x1" edc:name="PRSEG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRSEG2" edc:desc="" edc:mask="0x1" edc:name="PRSEG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH0" edc:desc="" edc:mask="0x1" edc:name="SEG1PH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH1" edc:desc="" edc:mask="0x1" edc:name="SEG1PH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH2" edc:desc="" edc:mask="0x1" edc:name="SEG1PH2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SEG2PH0" edc:desc="" edc:mask="0x1" edc:name="SEG2PH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH1" edc:desc="" edc:mask="0x1" edc:name="SEG2PH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH2" edc:desc="" edc:mask="0x1" edc:name="SEG2PH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1FEN1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000111111" edc:name="C1FEN1" edc:nzwidth="0x10" edc:por="0000000000111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTEN0" edc:desc="" edc:mask="0x1" edc:name="FLTEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN1" edc:desc="" edc:mask="0x1" edc:name="FLTEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN2" edc:desc="" edc:mask="0x1" edc:name="FLTEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN3" edc:desc="" edc:mask="0x1" edc:name="FLTEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN4" edc:desc="" edc:mask="0x1" edc:name="FLTEN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN5" edc:desc="" edc:mask="0x1" edc:name="FLTEN5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN6" edc:desc="" edc:mask="0x1" edc:name="FLTEN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN7" edc:desc="" edc:mask="0x1" edc:name="FLTEN7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN8" edc:desc="" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN9" edc:desc="" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN10" edc:desc="" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN11" edc:desc="" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN12" edc:desc="" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN13" edc:desc="" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN14" edc:desc="" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTEN15" edc:desc="" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTEN" edc:desc="" edc:mask="0xffff" edc:name="FLTEN" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1FMSKSEL1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1FMSKSEL1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F0MSK" edc:desc="" edc:mask="0x3" edc:name="F0MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F1MSK" edc:desc="" edc:mask="0x3" edc:name="F1MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F2MSK" edc:desc="" edc:mask="0x3" edc:name="F2MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F3MSK" edc:desc="" edc:mask="0x3" edc:name="F3MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F4MSK" edc:desc="" edc:mask="0x3" edc:name="F4MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F5MSK" edc:desc="" edc:mask="0x3" edc:name="F5MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F6MSK" edc:desc="" edc:mask="0x3" edc:name="F6MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F7MSK" edc:desc="" edc:mask="0x3" edc:name="F7MSK" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F0MSK0" edc:desc="" edc:mask="0x1" edc:name="F0MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F0MSK1" edc:desc="" edc:mask="0x1" edc:name="F0MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F1MSK0" edc:desc="" edc:mask="0x1" edc:name="F1MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F1MSK1" edc:desc="" edc:mask="0x1" edc:name="F1MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F2MSK0" edc:desc="" edc:mask="0x1" edc:name="F2MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F2MSK1" edc:desc="" edc:mask="0x1" edc:name="F2MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F3MSK0" edc:desc="" edc:mask="0x1" edc:name="F3MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F3MSK1" edc:desc="" edc:mask="0x1" edc:name="F3MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F4MSK0" edc:desc="" edc:mask="0x1" edc:name="F4MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F4MSK1" edc:desc="" edc:mask="0x1" edc:name="F4MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F5MSK0" edc:desc="" edc:mask="0x1" edc:name="F5MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F5MSK1" edc:desc="" edc:mask="0x1" edc:name="F5MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F6MSK0" edc:desc="" edc:mask="0x1" edc:name="F6MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F6MSK1" edc:desc="" edc:mask="0x1" edc:name="F6MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F7MSK0" edc:desc="" edc:mask="0x1" edc:name="F7MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F7MSK1" edc:desc="" edc:mask="0x1" edc:name="F7MSK1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1FMSKSEL2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1FMSKSEL2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F8MSK" edc:desc="" edc:mask="0x3" edc:name="F8MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F9MSK" edc:desc="" edc:mask="0x3" edc:name="F9MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F10MSK" edc:desc="" edc:mask="0x3" edc:name="F10MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F11MSK" edc:desc="" edc:mask="0x3" edc:name="F11MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F12MSK" edc:desc="" edc:mask="0x3" edc:name="F12MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F13MSK" edc:desc="" edc:mask="0x3" edc:name="F13MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F14MSK" edc:desc="" edc:mask="0x3" edc:name="F14MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F15MSK" edc:desc="" edc:mask="0x3" edc:name="F15MSK" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F8MSK0" edc:desc="" edc:mask="0x1" edc:name="F8MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F8MSK1" edc:desc="" edc:mask="0x1" edc:name="F8MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9MSK0" edc:desc="" edc:mask="0x1" edc:name="F9MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9MSK1" edc:desc="" edc:mask="0x1" edc:name="F9MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10MSK0" edc:desc="" edc:mask="0x1" edc:name="F10MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10MSK1" edc:desc="" edc:mask="0x1" edc:name="F10MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11MSK0" edc:desc="" edc:mask="0x1" edc:name="F11MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11MSK1" edc:desc="" edc:mask="0x1" edc:name="F11MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12MSK0" edc:desc="" edc:mask="0x1" edc:name="F12MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12MSK1" edc:desc="" edc:mask="0x1" edc:name="F12MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13MSK0" edc:desc="" edc:mask="0x1" edc:name="F13MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13MSK1" edc:desc="" edc:mask="0x1" edc:name="F13MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14MSK0" edc:desc="" edc:mask="0x1" edc:name="F14MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14MSK1" edc:desc="" edc:mask="0x1" edc:name="F14MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15MSK0" edc:desc="" edc:mask="0x1" edc:name="F15MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15MSK1" edc:desc="" edc:mask="0x1" edc:name="F15MSK1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1BUFPNT1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1BUFPNT1" edc:nmmrid="0x0" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F0BP" edc:desc="" edc:mask="0xf" edc:name="F0BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F1BP" edc:desc="" edc:mask="0xf" edc:name="F1BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F2BP" edc:desc="" edc:mask="0xf" edc:name="F2BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F3BP" edc:desc="" edc:mask="0xf" edc:name="F3BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F0BP0" edc:desc="" edc:mask="0x1" edc:name="F0BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F0BP1" edc:desc="" edc:mask="0x1" edc:name="F0BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F0BP2" edc:desc="" edc:mask="0x1" edc:name="F0BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F0BP3" edc:desc="" edc:mask="0x1" edc:name="F0BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP0" edc:desc="" edc:mask="0x1" edc:name="F1BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP1" edc:desc="" edc:mask="0x1" edc:name="F1BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP2" edc:desc="" edc:mask="0x1" edc:name="F1BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP3" edc:desc="" edc:mask="0x1" edc:name="F1BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP0" edc:desc="" edc:mask="0x1" edc:name="F2BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP1" edc:desc="" edc:mask="0x1" edc:name="F2BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP2" edc:desc="" edc:mask="0x1" edc:name="F2BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP3" edc:desc="" edc:mask="0x1" edc:name="F2BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP0" edc:desc="" edc:mask="0x1" edc:name="F3BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP1" edc:desc="" edc:mask="0x1" edc:name="F3BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP2" edc:desc="" edc:mask="0x1" edc:name="F3BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP3" edc:desc="" edc:mask="0x1" edc:name="F3BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C1RXFUL1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1RXFUL1" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RXFUL0" edc:desc="" edc:mask="0x1" edc:name="RXFUL0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL1" edc:desc="" edc:mask="0x1" edc:name="RXFUL1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL2" edc:desc="" edc:mask="0x1" edc:name="RXFUL2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL3" edc:desc="" edc:mask="0x1" edc:name="RXFUL3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL4" edc:desc="" edc:mask="0x1" edc:name="RXFUL4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL5" edc:desc="" edc:mask="0x1" edc:name="RXFUL5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL6" edc:desc="" edc:mask="0x1" edc:name="RXFUL6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL7" edc:desc="" edc:mask="0x1" edc:name="RXFUL7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL8" edc:desc="" edc:mask="0x1" edc:name="RXFUL8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL9" edc:desc="" edc:mask="0x1" edc:name="RXFUL9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL10" edc:desc="" edc:mask="0x1" edc:name="RXFUL10" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL11" edc:desc="" edc:mask="0x1" edc:name="RXFUL11" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL12" edc:desc="" edc:mask="0x1" edc:name="RXFUL12" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL13" edc:desc="" edc:mask="0x1" edc:name="RXFUL13" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL14" edc:desc="" edc:mask="0x1" edc:name="RXFUL14" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL15" edc:desc="" edc:mask="0x1" edc:name="RXFUL15" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1BUFPNT2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1BUFPNT2" edc:nmmrid="0x2" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F4BP" edc:desc="" edc:mask="0xf" edc:name="F4BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F5BP" edc:desc="" edc:mask="0xf" edc:name="F5BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F6BP" edc:desc="" edc:mask="0xf" edc:name="F6BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F7BP" edc:desc="" edc:mask="0xf" edc:name="F7BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F4BP0" edc:desc="" edc:mask="0x1" edc:name="F4BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F4BP1" edc:desc="" edc:mask="0x1" edc:name="F4BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F4BP2" edc:desc="" edc:mask="0x1" edc:name="F4BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F4BP3" edc:desc="" edc:mask="0x1" edc:name="F4BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP0" edc:desc="" edc:mask="0x1" edc:name="F5BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP1" edc:desc="" edc:mask="0x1" edc:name="F5BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP2" edc:desc="" edc:mask="0x1" edc:name="F5BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP3" edc:desc="" edc:mask="0x1" edc:name="F5BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP0" edc:desc="" edc:mask="0x1" edc:name="F6BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP1" edc:desc="" edc:mask="0x1" edc:name="F6BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP2" edc:desc="" edc:mask="0x1" edc:name="F6BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP3" edc:desc="" edc:mask="0x1" edc:name="F6BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP0" edc:desc="" edc:mask="0x1" edc:name="F7BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP1" edc:desc="" edc:mask="0x1" edc:name="F7BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP2" edc:desc="" edc:mask="0x1" edc:name="F7BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP3" edc:desc="" edc:mask="0x1" edc:name="F7BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
